Autodesk.Revit.DB.ExportFontInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.DestinationFontName
The destination font name (the name of the font in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.#ctor(System.String)
Constructs a new ExportFontInfo using the destination font name as input.
destinationFontName:
The destination font name (the name of the font in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.#ctor
Constructs a new default ExportFontInfo.
Since:
2014

Autodesk.Revit.DB.ExportFontInfo.#ctor(Autodesk.Revit.DB.ExportFontInfo)
Constructs a new copy of the input ExportFontInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontInfo
A value used to represent the info stored in an Autodesk.Revit.DB.ExportFontTable.
Since:
2014